logs/small/dsb-result_node5_threads16_conn16_read-user-timeline_network_socfb-Reed98-mode-numa-membind-2.log

CONFIG: node:5 threads:16 conn:16 workload:read-user-timeline network:socfb-Reed98 RPS:1000 numa-config:numa-membind-2
*************************************************************
Running 1m test @ http://localhost:8080/wrk2-api/user-timeline/read
  16 threads and 16 connections

  Thread calibration: mean lat.: 18.370ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 17.774ms, rate sampling interval: 65ms
  Thread calibration: mean lat.: 31.738ms, rate sampling interval: 136ms
  Thread calibration: mean lat.: 26.356ms, rate sampling interval: 93ms
  Thread calibration: mean lat.: 25.623ms, rate sampling interval: 110ms
  Thread calibration: mean lat.: 24.542ms, rate sampling interval: 106ms
  Thread calibration: mean lat.: 22.877ms, rate sampling interval: 88ms
  Thread calibration: mean lat.: 17.665ms, rate sampling interval: 67ms
  Thread calibration: mean lat.: 26.253ms, rate sampling interval: 100ms
  Thread calibration: mean lat.: 23.806ms, rate sampling interval: 90ms
  Thread calibration: mean lat.: 24.400ms, rate sampling interval: 95ms
  Thread calibration: mean lat.: 22.817ms, rate sampling interval: 91ms
  Thread calibration: mean lat.: 28.955ms, rate sampling interval: 109ms
  Thread calibration: mean lat.: 28.887ms, rate sampling interval: 129ms
  Thread calibration: mean lat.: 23.391ms, rate sampling interval: 88ms
  Thread calibration: mean lat.: 25.997ms, rate sampling interval: 108ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    26.21ms   19.78ms  98.69ms   85.79%
    Req/Sec    61.64     21.52   109.00     70.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.81ms
 75.000%   33.31ms
 90.000%   52.00ms
 99.000%   98.69ms
 99.900%  147.46ms
 99.990%  196.99ms
 99.999%  208.13ms
100.000%  208.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.299     0.000000            1         1.00
      10.015     0.100000         4949         1.11
      12.039     0.200000         9913         1.25
      13.343     0.300000        14862         1.43
      15.671     0.400000        19795         1.67
      19.807     0.500000        24763         2.00
      21.855     0.550000        27219         2.22
      23.983     0.600000        29699         2.50
      26.511     0.650000        32160         2.86
      29.679     0.700000        34649         3.33
      33.311     0.750000        37121         4.00
      35.391     0.775000        38348         4.44
      37.823     0.800000        39592         5.00
      40.511     0.825000        40825         5.71
      43.551     0.850000        42056         6.67
      47.487     0.875000        43295         8.00
      49.535     0.887500        43912         8.89
      51.999     0.900000        44532        10.00
      54.623     0.912500        45152        11.43
      57.471     0.925000        45769        13.33
      61.279     0.937500        46387        16.00
      63.391     0.943750        46698        17.78
      65.599     0.950000        47003        20.00
      68.351     0.956250        47315        22.86
      71.423     0.962500        47622        26.67
      75.327     0.968750        47932        32.00
      77.631     0.971875        48085        35.56
      80.191     0.975000        48240        40.00
      83.135     0.978125        48396        45.71
      86.079     0.981250        48551        53.33
      89.855     0.984375        48705        64.00
      91.903     0.985938        48782        71.11
      94.527     0.987500        48858        80.00
      96.767     0.989062        48935        91.43
     100.095     0.990625        49015       106.67
     103.807     0.992188        49090       128.00
     105.727     0.992969        49129       142.22
     108.031     0.993750        49169       160.00
     110.975     0.994531        49206       182.86
     115.967     0.995313        49245       213.33
     118.911     0.996094        49283       256.00
     121.919     0.996484        49303       284.44
     123.711     0.996875        49323       320.00
     126.911     0.997266        49341       365.71
     131.583     0.997656        49361       426.67
     135.039     0.998047        49380       512.00
     136.703     0.998242        49390       568.89
     139.391     0.998437        49399       640.00
     142.847     0.998633        49410       731.43
     145.407     0.998828        49419       853.33
     148.223     0.999023        49428      1024.00
     149.119     0.999121        49433      1137.78
     151.423     0.999219        49438      1280.00
     153.471     0.999316        49443      1462.86
     155.007     0.999414        49448      1706.67
     157.823     0.999512        49452      2048.00
     161.535     0.999561        49455      2275.56
     164.607     0.999609        49457      2560.00
     183.295     0.999658        49460      2925.71
     185.087     0.999707        49462      3413.33
     187.135     0.999756        49464      4096.00
     189.567     0.999780        49466      4551.11
     190.463     0.999805        49467      5120.00
     193.919     0.999829        49468      5851.43
     194.175     0.999854        49469      6826.67
     194.943     0.999878        49470      8192.00
     196.991     0.999890        49472      9102.22
     196.991     0.999902        49472     10240.00
     196.991     0.999915        49472     11702.86
     200.319     0.999927        49473     13653.33
     200.319     0.999939        49473     16384.00
     201.727     0.999945        49474     18204.44
     201.727     0.999951        49474     20480.00
     201.727     0.999957        49474     23405.71
     206.591     0.999963        49475     27306.67
     206.591     0.999969        49475     32768.00
     206.591     0.999973        49475     36408.89
     206.591     0.999976        49475     40960.00
     206.591     0.999979        49475     46811.43
     208.127     0.999982        49476     54613.33
     208.127     1.000000        49476          inf
#[Mean    =       26.214, StdDeviation   =       19.780]
#[Max     =      208.000, Total count    =        49476]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  59302 requests in 1.00m, 819.25MB read
Requests/sec:    988.32  
Transfer/sec:     13.65MB
*************************************************************

CONFIG: node:5 threads:16 conn:16 workload:read-user-timeline network:socfb-Reed98 RPS:5000 numa-config:numa-membind-2
*************************************************************
Running 1m test @ http://localhost:8080/wrk2-api/user-timeline/read
  16 threads and 16 connections

  Thread calibration: mean lat.: 2089.100ms, rate sampling interval: 6209ms
  Thread calibration: mean lat.: 1889.455ms, rate sampling interval: 5955ms
  Thread calibration: mean lat.: 2089.720ms, rate sampling interval: 6328ms
  Thread calibration: mean lat.: 1861.799ms, rate sampling interval: 5144ms
  Thread calibration: mean lat.: 2619.814ms, rate sampling interval: 7716ms
  Thread calibration: mean lat.: 1793.867ms, rate sampling interval: 4919ms
  Thread calibration: mean lat.: 1726.451ms, rate sampling interval: 5038ms
  Thread calibration: mean lat.: 2221.264ms, rate sampling interval: 6291ms
  Thread calibration: mean lat.: 1898.035ms, rate sampling interval: 5947ms
  Thread calibration: mean lat.: 1922.079ms, rate sampling interval: 5828ms
  Thread calibration: mean lat.: 2480.913ms, rate sampling interval: 7299ms
  Thread calibration: mean lat.: 2811.762ms, rate sampling interval: 8732ms
  Thread calibration: mean lat.: 2816.520ms, rate sampling interval: 8880ms
  Thread calibration: mean lat.: 2664.725ms, rate sampling interval: 8384ms
  Thread calibration: mean lat.: 2971.893ms, rate sampling interval: 9445ms
  Thread calibration: mean lat.: 2065.806ms, rate sampling interval: 6348ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.81s     4.83s   23.56s    70.48%
    Req/Sec   236.60     33.27   281.00     60.18%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.85s 
 75.000%   11.77s 
 90.000%   17.51s 
 99.000%   23.56s 
 99.900%   24.94s 
 99.990%   25.31s 
 99.999%   25.38s 
100.000%   25.38s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2613.247     0.000000            4         1.00
    4538.367     0.100000        18631         1.11
    5713.919     0.200000        37285         1.25
    6828.031     0.300000        55903         1.43
    7872.511     0.400000        74538         1.67
    8847.359     0.500000        93232         2.00
    9371.647     0.550000       102506         2.22
    9895.935     0.600000       111821         2.50
   10461.183     0.650000       121136         2.86
   11157.503     0.700000       130481         3.33
   11771.903     0.750000       139711         4.00
   12189.695     0.775000       144390         4.44
   12845.055     0.800000       149045         5.00
   13688.831     0.825000       153663         5.71
   14770.175     0.850000       158308         6.67
   16252.927     0.875000       162968         8.00
   17039.359     0.887500       165321         8.89
   17514.495     0.900000       167631        10.00
   18219.007     0.912500       169976        11.43
   18841.599     0.925000       172276        13.33
   19513.343     0.937500       174642        16.00
   19824.639     0.943750       175768        17.78
   20348.927     0.950000       176951        20.00
   20889.599     0.956250       178119        22.86
   21233.663     0.962500       179269        26.67
   21594.111     0.968750       180461        32.00
   21790.719     0.971875       181012        35.56
   21987.327     0.975000       181594        40.00
   22331.391     0.978125       182183        45.71
   22495.231     0.981250       182769        53.33
   22708.223     0.984375       183338        64.00
   22921.215     0.985938       183644        71.11
   23183.359     0.987500       183927        80.00
   23396.351     0.989062       184217        91.43
   23642.111     0.990625       184531       106.67
   23838.719     0.992188       184806       128.00
   23953.407     0.992969       184943       142.22
   24084.479     0.993750       185094       160.00
   24231.935     0.994531       185247       182.86
   24313.855     0.995313       185371       213.33
   24428.543     0.996094       185526       256.00
   24477.695     0.996484       185595       284.44
   24526.847     0.996875       185692       320.00
   24559.615     0.997266       185755       365.71
   24592.383     0.997656       185815       426.67
   24657.919     0.998047       185906       512.00
   24674.303     0.998242       185927       568.89
   24707.071     0.998437       185955       640.00
   24756.223     0.998633       185994       731.43
   24838.143     0.998828       186025       853.33
   24952.831     0.999023       186065      1024.00
   24985.599     0.999121       186082      1137.78
   25051.135     0.999219       186098      1280.00
   25100.287     0.999316       186126      1462.86
   25116.671     0.999414       186137      1706.67
   25149.439     0.999512       186156      2048.00
   25165.823     0.999561       186162      2275.56
   25198.591     0.999609       186172      2560.00
   25231.359     0.999658       186186      2925.71
   25247.743     0.999707       186196      3413.33
   25264.127     0.999756       186205      4096.00
   25264.127     0.999780       186205      4551.11
   25280.511     0.999805       186215      5120.00
   25280.511     0.999829       186215      5851.43
   25296.895     0.999854       186220      6826.67
   25313.279     0.999878       186226      8192.00
   25313.279     0.999890       186226      9102.22
   25313.279     0.999902       186226     10240.00
   25329.663     0.999915       186230     11702.86
   25329.663     0.999927       186230     13653.33
   25346.047     0.999939       186233     16384.00
   25346.047     0.999945       186233     18204.44
   25362.431     0.999951       186239     20480.00
   25362.431     0.999957       186239     23405.71
   25362.431     0.999963       186239     27306.67
   25362.431     0.999969       186239     32768.00
   25362.431     0.999973       186239     36408.89
   25362.431     0.999976       186239     40960.00
   25378.815     0.999979       186243     46811.43
   25378.815     1.000000       186243          inf
#[Mean    =     9813.793, StdDeviation   =     4829.561]
#[Max     =    25362.432, Total count    =       186243]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  217942 requests in 1.00m, 2.94GB read
Requests/sec:   3632.34  
Transfer/sec:     50.19MB
*************************************************************

CONFIG: node:5 threads:16 conn:16 workload:read-user-timeline network:socfb-Reed98 RPS:10000 numa-config:numa-membind-2
*************************************************************
Running 1m test @ http://localhost:8080/wrk2-api/user-timeline/read
  16 threads and 16 connections

  Thread calibration: mean lat.: 2870.268ms, rate sampling interval: 10289ms
  Thread calibration: mean lat.: 3180.177ms, rate sampling interval: 12099ms
  Thread calibration: mean lat.: 3339.704ms, rate sampling interval: 11280ms
  Thread calibration: mean lat.: 3250.251ms, rate sampling interval: 11567ms
  Thread calibration: mean lat.: 2883.696ms, rate sampling interval: 9846ms
  Thread calibration: mean lat.: 2878.520ms, rate sampling interval: 10043ms
  Thread calibration: mean lat.: 3503.388ms, rate sampling interval: 12427ms
  Thread calibration: mean lat.: 2829.474ms, rate sampling interval: 10117ms
  Thread calibration: mean lat.: 3080.705ms, rate sampling interval: 10289ms
  Thread calibration: mean lat.: 3261.989ms, rate sampling interval: 11132ms
  Thread calibration: mean lat.: 3295.056ms, rate sampling interval: 11583ms
  Thread calibration: mean lat.: 3068.656ms, rate sampling interval: 11968ms
  Thread calibration: mean lat.: 3333.623ms, rate sampling interval: 12271ms
  Thread calibration: mean lat.: 3593.740ms, rate sampling interval: 12845ms
  Thread calibration: mean lat.: 3285.647ms, rate sampling interval: 11157ms
  Thread calibration: mean lat.: 3740.314ms, rate sampling interval: 13074ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    21.90s     9.27s   39.78s    58.65%
    Req/Sec   237.32     37.75   305.00     58.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.02s 
 75.000%   29.70s 
 90.000%   34.50s 
 99.000%   39.78s 
 99.900%   41.16s 
 99.990%   41.55s 
 99.999%   41.62s 
100.000%   41.62s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5419.007     0.000000            2         1.00
    9207.807     0.100000        19000         1.11
   12238.847     0.200000        37917         1.25
   15327.231     0.300000        56841         1.43
   18710.527     0.400000        75852         1.67
   22020.095     0.500000        94784         2.00
   23576.575     0.550000       104239         2.22
   25100.287     0.600000       113672         2.50
   26689.535     0.650000       123203         2.86
   28180.479     0.700000       132652         3.33
   29704.191     0.750000       142126         4.00
   30474.239     0.775000       146912         4.44
   31178.751     0.800000       151640         5.00
   31932.415     0.825000       156286         5.71
   32767.999     0.850000       161064         6.67
   33652.735     0.875000       165845         8.00
   34078.719     0.887500       168148         8.89
   34504.703     0.900000       170494        10.00
   34963.455     0.912500       172999        11.43
   35356.671     0.925000       175279        13.33
   35782.655     0.937500       177638        16.00
   36044.799     0.943750       178819        17.78
   36372.479     0.950000       180063        20.00
   36667.391     0.956250       181200        22.86
   36995.071     0.962500       182417        26.67
   37322.751     0.968750       183574        32.00
   37552.127     0.971875       184171        35.56
   37879.807     0.975000       184751        40.00
   38240.255     0.978125       185288        45.71
   38600.703     0.981250       185906        53.33
   39026.687     0.984375       186503        64.00
   39223.295     0.985938       186781        71.11
   39452.671     0.987500       187086        80.00
   39649.279     0.989062       187359        91.43
   39845.887     0.990625       187672       106.67
   40075.263     0.992188       188001       128.00
   40140.799     0.992969       188099       142.22
   40239.103     0.993750       188253       160.00
   40337.407     0.994531       188417       182.86
   40435.711     0.995313       188579       213.33
   40534.015     0.996094       188735       256.00
   40566.783     0.996484       188784       284.44
   40599.551     0.996875       188844       320.00
   40697.855     0.997266       188939       365.71
   40763.391     0.997656       188994       426.67
   40861.695     0.998047       189074       512.00
   40894.463     0.998242       189099       568.89
   40959.999     0.998437       189150       640.00
   40992.767     0.998633       189173       731.43
   41091.071     0.998828       189222       853.33
   41156.607     0.999023       189253      1024.00
   41189.375     0.999121       189268      1137.78
   41254.911     0.999219       189300      1280.00
   41287.679     0.999316       189316      1462.86
   41320.447     0.999414       189335      1706.67
   41353.215     0.999512       189350      2048.00
   41353.215     0.999561       189350      2275.56
   41385.983     0.999609       189368      2560.00
   41385.983     0.999658       189368      2925.71
   41418.751     0.999707       189382      3413.33
   41451.519     0.999756       189392      4096.00
   41451.519     0.999780       189392      4551.11
   41484.287     0.999805       189399      5120.00
   41484.287     0.999829       189399      5851.43
   41517.055     0.999854       189407      6826.67
   41517.055     0.999878       189407      8192.00
   41549.823     0.999890       189416      9102.22
   41549.823     0.999902       189416     10240.00
   41549.823     0.999915       189416     11702.86
   41582.591     0.999927       189424     13653.33
   41582.591     0.999939       189424     16384.00
   41582.591     0.999945       189424     18204.44
   41582.591     0.999951       189424     20480.00
   41582.591     0.999957       189424     23405.71
   41582.591     0.999963       189424     27306.67
   41615.359     0.999969       189430     32768.00
   41615.359     1.000000       189430          inf
#[Mean    =    21895.764, StdDeviation   =     9266.774]
#[Max     =    41582.592, Total count    =       189430]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  226385 requests in 1.00m, 3.05GB read
Requests/sec:   3773.12  
Transfer/sec:     52.13MB
*************************************************************

CONFIG: node:5 threads:16 conn:16 workload:read-user-timeline network:socfb-Reed98 RPS:100000 numa-config:numa-membind-2
*************************************************************
Running 1m test @ http://localhost:8080/wrk2-api/user-timeline/read
  16 threads and 16 connections

  Thread calibration: mean lat.: 4919.419ms, rate sampling interval: 17367ms
  Thread calibration: mean lat.: 5056.449ms, rate sampling interval: 17465ms
  Thread calibration: mean lat.: 4780.394ms, rate sampling interval: 17219ms
  Thread calibration: mean lat.: 4854.869ms, rate sampling interval: 17219ms
  Thread calibration: mean lat.: 4724.546ms, rate sampling interval: 17416ms
  Thread calibration: mean lat.: 5064.766ms, rate sampling interval: 17498ms
  Thread calibration: mean lat.: 4780.813ms, rate sampling interval: 17203ms
  Thread calibration: mean lat.: 4738.439ms, rate sampling interval: 17432ms
  Thread calibration: mean lat.: 4849.149ms, rate sampling interval: 17137ms
  Thread calibration: mean lat.: 4807.077ms, rate sampling interval: 17186ms
  Thread calibration: mean lat.: 4573.252ms, rate sampling interval: 17203ms
  Thread calibration: mean lat.: 4794.794ms, rate sampling interval: 17186ms
  Thread calibration: mean lat.: 4897.742ms, rate sampling interval: 17367ms
  Thread calibration: mean lat.: 4731.884ms, rate sampling interval: 17252ms
  Thread calibration: mean lat.: 4621.147ms, rate sampling interval: 17285ms
  Thread calibration: mean lat.: 4580.390ms, rate sampling interval: 17104ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    33.58s    13.96s    0.95m    57.47%
    Req/Sec   229.59     45.12   290.00     37.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.47s 
 75.000%   45.78s 
 90.000%    0.88m 
 99.000%    0.95m 
 99.900%    0.97m 
 99.990%    0.97m 
 99.999%    0.97m 
100.000%    0.97m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9535.487     0.000000            1         1.00
   14393.343     0.100000        18446         1.11
   19070.975     0.200000        36933         1.25
   23707.647     0.300000        55393         1.43
   28622.847     0.400000        73790         1.67
   33472.511     0.500000        92246         2.00
   35946.495     0.550000       101543         2.22
   38469.631     0.600000       110772         2.50
   40894.463     0.650000       119968         2.86
   43384.831     0.700000       129211         3.33
   45776.895     0.750000       138394         4.00
   46989.311     0.775000       143017         4.44
   48201.727     0.800000       147595         5.00
   49446.911     0.825000       152286         5.71
   50626.559     0.850000       156815         6.67
   51806.207     0.875000       161510         8.00
   52363.263     0.887500       163747         8.89
   52953.087     0.900000       166055        10.00
   53542.911     0.912500       168344        11.43
   54132.735     0.925000       170630        13.33
   54755.327     0.937500       172968        16.00
   55083.007     0.943750       174192        17.78
   55377.919     0.950000       175341        20.00
   55640.063     0.956250       176380        22.86
   55934.975     0.962500       177551        26.67
   56229.887     0.968750       178720        32.00
   56393.727     0.971875       179363        35.56
   56524.799     0.975000       179892        40.00
   56655.871     0.978125       180429        45.71
   56819.711     0.981250       181088        53.33
   56950.783     0.984375       181595        64.00
   57049.087     0.985938       181968        71.11
   57114.623     0.987500       182210        80.00
   57180.159     0.989062       182461        91.43
   57278.463     0.990625       182830       106.67
   57343.999     0.992188       183057       128.00
   57376.767     0.992969       183155       142.22
   57442.303     0.993750       183314       160.00
   57507.839     0.994531       183444       182.86
   57606.143     0.995313       183617       213.33
   57704.447     0.996094       183763       256.00
   57737.215     0.996484       183805       284.44
   57802.751     0.996875       183894       320.00
   57868.287     0.997266       183981       365.71
   57901.055     0.997656       184024       426.67
   57966.591     0.998047       184111       512.00
   57999.359     0.998242       184155       568.89
   58032.127     0.998437       184198       640.00
   58032.127     0.998633       184198       731.43
   58064.895     0.998828       184237       853.33
   58097.663     0.999023       184282      1024.00
   58130.431     0.999121       184322      1137.78
   58130.431     0.999219       184322      1280.00
   58130.431     0.999316       184322      1462.86
   58163.199     0.999414       184363      1706.67
   58163.199     0.999512       184363      2048.00
   58195.967     0.999561       184403      2275.56
   58195.967     0.999609       184403      2560.00
   58195.967     0.999658       184403      2925.71
   58195.967     0.999707       184403      3413.33
   58195.967     0.999756       184403      4096.00
   58228.735     0.999780       184434      4551.11
   58228.735     0.999805       184434      5120.00
   58228.735     0.999829       184434      5851.43
   58228.735     0.999854       184434      6826.67
   58228.735     0.999878       184434      8192.00
   58228.735     0.999890       184434      9102.22
   58228.735     0.999902       184434     10240.00
   58228.735     0.999915       184434     11702.86
   58228.735     0.999927       184434     13653.33
   58261.503     0.999939       184444     16384.00
   58261.503     0.999945       184444     18204.44
   58261.503     0.999951       184444     20480.00
   58261.503     0.999957       184444     23405.71
   58261.503     0.999963       184444     27306.67
   58261.503     0.999969       184444     32768.00
   58261.503     0.999973       184444     36408.89
   58261.503     0.999976       184444     40960.00
   58261.503     0.999979       184444     46811.43
   58261.503     0.999982       184444     54613.33
   58294.271     0.999985       184447     65536.00
   58294.271     1.000000       184447          inf
#[Mean    =    33583.214, StdDeviation   =    13961.501]
#[Max     =    58261.504, Total count    =       184447]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  222619 requests in 1.00m, 3.00GB read
  Socket errors: connect 0, read 0, write 0, timeout 355
Requests/sec:   3710.30  
Transfer/sec:     51.26MB
*************************************************************